frostfire45/Codewarrior/Lib/hc12c/include/mc9s12vr32.h
/*** FOPT - Flash Option Register; 0x00000110 ***/
typedef union {
  byte Byte;
  struct {
    byte NV0         :1;                                       /* Nonvolatile Bit 0 */
    byte NV1         :1;                                       /* Nonvolatile Bit 1 */
    byte NV2         :1;                                       /* Nonvolatile Bit 2 */
    byte NV3         :1;                                       /* Nonvolatile Bit 3 */
    byte NV4         :1;                                       /* Nonvolatile Bit 4 */
    byte NV5         :1;                                       /* Nonvolatile Bit 5 */
    byte NV6         :1;                                       /* Nonvolatile Bit 6 */
    byte NV7         :1;                                       /* Nonvolatile Bit 7 */
  } Bits;
} FOPTSTR;
extern volatile FOPTSTR _FOPT @(REG_BASE + 0x00000110UL);
#define FOPT                            _FOPT.Byte
#define FOPT_NV0                        _FOPT.Bits.NV0
#define FOPT_NV1                        _FOPT.Bits.NV1
#define FOPT_NV2                        _FOPT.Bits.NV2
#define FOPT_NV3                        _FOPT.Bits.NV3
#define FOPT_NV4                        _FOPT.Bits.NV4
#define FOPT_NV5                        _FOPT.Bits.NV5
#define FOPT_NV6                        _FOPT.Bits.NV6
#define FOPT_NV7                        _FOPT.Bits.NV7

#define FOPT_NV0_MASK                   1U
#define FOPT_NV1_MASK                   2U
#define FOPT_NV2_MASK                   4U
#define FOPT_NV3_MASK                   8U
#define FOPT_NV4_MASK                   16U
#define FOPT_NV5_MASK                   32U
#define FOPT_NV6_MASK                   64U
#define FOPT_NV7_MASK                   128U


/*** IVBR - Interrupt Vector Base Register; 0x00000120 ***/
typedef union {
  byte Byte;
  struct {
    byte IVB_ADDR0   :1;                                       /* Interrupt Vector Base Address Bits, bit 0 */
    byte IVB_ADDR1   :1;                                       /* Interrupt Vector Base Address Bits, bit 1 */
    byte IVB_ADDR2   :1;                                       /* Interrupt Vector Base Address Bits, bit 2 */
    byte IVB_ADDR3   :1;                                       /* Interrupt Vector Base Address Bits, bit 3 */
    byte IVB_ADDR4   :1;                                       /* Interrupt Vector Base Address Bits, bit 4 */
    byte IVB_ADDR5   :1;                                       /* Interrupt Vector Base Address Bits, bit 5 */
    byte IVB_ADDR6   :1;                                       /* Interrupt Vector Base Address Bits, bit 6 */
    byte IVB_ADDR7   :1;                                       /* Interrupt Vector Base Address Bits, bit 7 */
  } Bits;
} IVBRSTR;
extern volatile IVBRSTR _IVBR @(REG_BASE + 0x00000120UL);
#define IVBR                            _IVBR.Byte
#define IVBR_IVB_ADDR0                  _IVBR.Bits.IVB_ADDR0
#define IVBR_IVB_ADDR1                  _IVBR.Bits.IVB_ADDR1
#define IVBR_IVB_ADDR2                  _IVBR.Bits.IVB_ADDR2
#define IVBR_IVB_ADDR3                  _IVBR.Bits.IVB_ADDR3
#define IVBR_IVB_ADDR4                  _IVBR.Bits.IVB_ADDR4
#define IVBR_IVB_ADDR5                  _IVBR.Bits.IVB_ADDR5
#define IVBR_IVB_ADDR6                  _IVBR.Bits.IVB_ADDR6
#define IVBR_IVB_ADDR7                  _IVBR.Bits.IVB_ADDR7

#define IVBR_IVB_ADDR0_MASK             1U
#define IVBR_IVB_ADDR1_MASK             2U
#define IVBR_IVB_ADDR2_MASK             4U
#define IVBR_IVB_ADDR3_MASK             8U
#define IVBR_IVB_ADDR4_MASK             16U
#define IVBR_IVB_ADDR5_MASK             32U
#define IVBR_IVB_ADDR6_MASK             64U
#define IVBR_IVB_ADDR7_MASK             128U


/*** HSDR - Port HS Data Register; 0x00000140 ***/
typedef union {
  byte Byte;
  struct {
    byte HSDR0       :1;                                       /* Port HS Data Bit 0 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} HSDRSTR;
extern volatile HSDRSTR _HSDR @(REG_BASE + 0x00000140UL);
#define HSDR                            _HSDR.Byte
#define HSDR_HSDR0                      _HSDR.Bits.HSDR0

#define HSDR_HSDR0_MASK                 1U


/*** HSCR - HSDRV Configuration Register; 0x00000141 ***/
typedef union {
  byte Byte;
  struct {
    byte HSE0        :1;                                       /* HSDRV Enable Bit 0 */
    byte             :1; 
    byte HSOLE0      :1;                                       /* HSDRV High-Load resistance Open-Load Detection Enable Bit 0 */
    byte             :1; 
    byte HSOCME0     :1;                                       /* HSDRV Over-Current Mask Enable Bit0 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} HSCRSTR;
extern volatile HSCRSTR _HSCR @(REG_BASE + 0x00000141UL);
#define HSCR                            _HSCR.Byte
#define HSCR_HSE0                       _HSCR.Bits.HSE0
#define HSCR_HSOLE0                     _HSCR.Bits.HSOLE0
#define HSCR_HSOCME0                    _HSCR.Bits.HSOCME0

#define HSCR_HSE0_MASK                  1U
#define HSCR_HSOLE0_MASK                4U
#define HSCR_HSOCME0_MASK               16U


/*** HSSLR - HSDRV Slew Rate Control Register; 0x00000142 ***/
typedef union {
  byte Byte;
  struct {
    byte HSSLEN0     :1;                                       /* Slew Rate Control Enable 0 */
    byte             :1; 
    byte HSSLCU0     :1;                                       /* Slew Current Reduction Enable 0 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} HSSLRSTR;
extern volatile HSSLRSTR _HSSLR @(REG_BASE + 0x00000142UL);
#define HSSLR                           _HSSLR.Byte
#define HSSLR_HSSLEN0                   _HSSLR.Bits.HSSLEN0
#define HSSLR_HSSLCU0                   _HSSLR.Bits.HSSLCU0

#define HSSLR_HSSLEN0_MASK              1U
#define HSSLR_HSSLCU0_MASK              4U


/*** HSSR - HSDRV Status Register; 0x00000145 ***/
typedef union {
  byte Byte;
  struct {
    byte HSOL0       :1;                                       /* HSDRV Open-Load Status Bit 0 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} HSSRSTR;
