frostfire45/Codewarrior/Lib/hc12c/include/mc9s12vr32.h
extern volatile LPCRSTR _LPCR @(REG_BASE + 0x00000161UL);
#define LPCR                            _LPCR.Byte
#define LPCR_LPPUE                      _LPCR.Bits.LPPUE
#define LPCR_LPWUE                      _LPCR.Bits.LPWUE
#define LPCR_RXONLY                     _LPCR.Bits.RXONLY
#define LPCR_LPE                        _LPCR.Bits.LPE

#define LPCR_LPPUE_MASK                 1U
#define LPCR_LPWUE_MASK                 2U
#define LPCR_RXONLY_MASK                4U
#define LPCR_LPE_MASK                   8U


/*** LPSLRM - LIN Slew Rate Register; 0x00000163 ***/
typedef union {
  byte Byte;
  struct {
    byte LPSLR       :2;                                       /* Slew rate select */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte LPDTDIS     :1;                                       /* TxD-dominant timeout disable */
  } Bits;
} LPSLRMSTR;
extern volatile LPSLRMSTR _LPSLRM @(REG_BASE + 0x00000163UL);
#define LPSLRM                          _LPSLRM.Byte
#define LPSLRM_LPSLR                    _LPSLRM.Bits.LPSLR
#define LPSLRM_LPDTDIS                  _LPSLRM.Bits.LPDTDIS

#define LPSLRM_LPSLR_MASK               3U
#define LPSLRM_LPSLR_BITNUM             0U
#define LPSLRM_LPDTDIS_MASK             128U


/*** LPSR - LIN Status Register; 0x00000165 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte LPDT        :1;                                       /* LIN Transmitter TxD-dominant timeout Status */
  } Bits;
} LPSRSTR;
extern volatile LPSRSTR _LPSR @(REG_BASE + 0x00000165UL);
#define LPSR                            _LPSR.Byte
#define LPSR_LPDT                       _LPSR.Bits.LPDT

#define LPSR_LPDT_MASK                  128U


/*** LPIE - LIN Interrupt Enable Register; 0x00000166 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte LPOCIE      :1;                                       /* LIN over-current interrupt enable */
    byte LPDTIE      :1;                                       /* LIN TxD-dominant timeout Interrupt Enable */
  } Bits;
} LPIESTR;
extern volatile LPIESTR _LPIE @(REG_BASE + 0x00000166UL);
#define LPIE                            _LPIE.Byte
#define LPIE_LPOCIE                     _LPIE.Bits.LPOCIE
#define LPIE_LPDTIE                     _LPIE.Bits.LPDTIE

#define LPIE_LPOCIE_MASK                64U
#define LPIE_LPDTIE_MASK                128U


/*** LPIF - LIN Interrupt Flags Register; 0x00000167 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte LPOCIF      :1;                                       /* LIN transmitter over-current interrupt flag */
    byte LPDTIF      :1;                                       /* LIN Transmitter TxD-dominant timeout Interrupt Flag */
  } Bits;
} LPIFSTR;
extern volatile LPIFSTR _LPIF @(REG_BASE + 0x00000167UL);
#define LPIF                            _LPIF.Byte
#define LPIF_LPOCIF                     _LPIF.Bits.LPOCIF
#define LPIF_LPDTIF                     _LPIF.Bits.LPDTIF

#define LPIF_LPOCIF_MASK                64U
#define LPIF_LPDTIF_MASK                128U


/*** BATE - BATS Module Enable Register; 0x00000170 ***/
typedef union {
  byte Byte;
  struct {
    byte BSESE       :1;                                       /* BATS VSENSE Level Sense Enable */
    byte BSEAE       :1;                                       /* BATS VSENSE ADC Connection Enable */
    byte BSUSE       :1;                                       /* BATS VSUP Level Sense Enable */
    byte BSUAE       :1;                                       /* BATS VSUP ADC Connection Enable */
    byte BVLS        :2;                                       /* BATS Voltage Low Select */
    byte BVHS        :1;                                       /* BATS Voltage High Select */
    byte             :1; 
  } Bits;
} BATESTR;
extern volatile BATESTR _BATE @(REG_BASE + 0x00000170UL);
#define BATE                            _BATE.Byte
#define BATE_BSESE                      _BATE.Bits.BSESE
#define BATE_BSEAE                      _BATE.Bits.BSEAE
#define BATE_BSUSE                      _BATE.Bits.BSUSE
#define BATE_BSUAE                      _BATE.Bits.BSUAE
#define BATE_BVLS                       _BATE.Bits.BVLS
#define BATE_BVHS                       _BATE.Bits.BVHS

#define BATE_BSESE_MASK                 1U
#define BATE_BSEAE_MASK                 2U
#define BATE_BSUSE_MASK                 4U
#define BATE_BSUAE_MASK                 8U
#define BATE_BVLS_MASK                  48U
#define BATE_BVLS_BITNUM                4U
#define BATE_BVHS_MASK                  64U


/*** BATSR - BATS Module Status Register; 0x00000171 ***/
typedef union {
  byte Byte;
  struct {
    byte BVLC        :1;                                       /* BATS Voltage Sense Low Condition Bit */
    byte BVHC        :1;                                       /* BATS Voltage Sense High Condition Bit */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} BATSRSTR;
extern volatile BATSRSTR _BATSR @(REG_BASE + 0x00000171UL);
#define BATSR                           _BATSR.Byte
#define BATSR_BVLC                      _BATSR.Bits.BVLC
#define BATSR_BVHC                      _BATSR.Bits.BVHC

#define BATSR_BVLC_MASK                 1U
#define BATSR_BVHC_MASK                 2U


/*** BATIE - BATS Interrupt Enable Register; 0x00000172 ***/
typedef union {
  byte Byte;
  struct {
    byte BVLIE       :1;                                       /* BATS Interrupt Enable Low */
    byte BVHIE       :1;                                       /* BATS Interrupt Enable High */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} BATIESTR;
