frostfire45/Codewarrior/Lib/hc12c/include/mc9s12vr32.h
#define PIFP_PIFP1_MASK                 2U
#define PIFP_PIFP2_MASK                 4U
#define PIFP_OCIF_MASK                  128U
#define PIFP_PIFP_1_MASK                6U
#define PIFP_PIFP_1_BITNUM              1U


/*** PTIL - Port L Input Register; 0x00000269 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIL0       :1;                                       /* Port Input data register port L Bit 0 */
    byte PTIL1       :1;                                       /* Port Input data register port L Bit 1 */
    byte PTIL2       :1;                                       /* Port Input data register port L Bit 2 */
    byte PTIL3       :1;                                       /* Port Input data register port L Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPTIL :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTILSTR;
extern volatile PTILSTR _PTIL @(REG_BASE + 0x00000269UL);
#define PTIL                            _PTIL.Byte
#define PTIL_PTIL0                      _PTIL.Bits.PTIL0
#define PTIL_PTIL1                      _PTIL.Bits.PTIL1
#define PTIL_PTIL2                      _PTIL.Bits.PTIL2
#define PTIL_PTIL3                      _PTIL.Bits.PTIL3
#define PTIL_PTIL                       _PTIL.MergedBits.grpPTIL

#define PTIL_PTIL0_MASK                 1U
#define PTIL_PTIL1_MASK                 2U
#define PTIL_PTIL2_MASK                 4U
#define PTIL_PTIL3_MASK                 8U
#define PTIL_PTIL_MASK                  15U
#define PTIL_PTIL_BITNUM                0U


/*** DIENL - Port L Digital Input Enable Register; 0x0000026A ***/
typedef union {
  byte Byte;
  struct {
    byte DIENL0      :1;                                       /* Digital Input Enable Port L Bit 0 */
    byte DIENL1      :1;                                       /* Digital Input Enable Port L Bit 1 */
    byte DIENL2      :1;                                       /* Digital Input Enable Port L Bit 2 */
    byte DIENL3      :1;                                       /* Digital Input Enable Port L Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDIENL :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} DIENLSTR;
extern volatile DIENLSTR _DIENL @(REG_BASE + 0x0000026AUL);
#define DIENL                           _DIENL.Byte
#define DIENL_DIENL0                    _DIENL.Bits.DIENL0
#define DIENL_DIENL1                    _DIENL.Bits.DIENL1
#define DIENL_DIENL2                    _DIENL.Bits.DIENL2
#define DIENL_DIENL3                    _DIENL.Bits.DIENL3
#define DIENL_DIENL                     _DIENL.MergedBits.grpDIENL

#define DIENL_DIENL0_MASK               1U
#define DIENL_DIENL1_MASK               2U
#define DIENL_DIENL2_MASK               4U
#define DIENL_DIENL3_MASK               8U
#define DIENL_DIENL_MASK                15U
#define DIENL_DIENL_BITNUM              0U


/*** PTAL - Port L Analog Access Register; 0x0000026B ***/
typedef union {
  byte Byte;
  struct {
    byte PTAL0       :1;                                       /* Port ADC connection selector, bit 0 */
    byte PTAL1       :1;                                       /* Port ADC connection selector, bit 1 */
    byte             :1; 
    byte PTAENL      :1;                                       /* Port ADC connection enable */
    byte PTADIRL     :1;                                       /* Port ADC direct connection */
    byte PTABYPL     :1;                                       /* Port ADC connection bypass */
    byte PTPSL       :1;                                       /* Port pull select */
    byte PTTEL       :1;                                       /* Port test enable */
  } Bits;
  struct {
    byte grpPTAL :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTALSTR;
extern volatile PTALSTR _PTAL @(REG_BASE + 0x0000026BUL);
#define PTAL                            _PTAL.Byte
#define PTAL_PTAL0                      _PTAL.Bits.PTAL0
#define PTAL_PTAL1                      _PTAL.Bits.PTAL1
#define PTAL_PTAENL                     _PTAL.Bits.PTAENL
#define PTAL_PTADIRL                    _PTAL.Bits.PTADIRL
#define PTAL_PTABYPL                    _PTAL.Bits.PTABYPL
#define PTAL_PTPSL                      _PTAL.Bits.PTPSL
#define PTAL_PTTEL                      _PTAL.Bits.PTTEL
#define PTAL_PTAL                       _PTAL.MergedBits.grpPTAL

#define PTAL_PTAL0_MASK                 1U
#define PTAL_PTAL1_MASK                 2U
#define PTAL_PTAENL_MASK                8U
#define PTAL_PTADIRL_MASK               16U
#define PTAL_PTABYPL_MASK               32U
#define PTAL_PTPSL_MASK                 64U
#define PTAL_PTTEL_MASK                 128U
#define PTAL_PTAL_MASK                  3U
#define PTAL_PTAL_BITNUM                0U


/*** PIRL - Port L Input Divider Ratio Selection Register; 0x0000026C ***/
typedef union {
  byte Byte;
  struct {
    byte PIRL0       :1;                                       /* Port L Input Divider Ratio SelectBit 0 */
    byte PIRL1       :1;                                       /* Port L Input Divider Ratio SelectBit 1 */
    byte PIRL2       :1;                                       /* Port L Input Divider Ratio SelectBit 2 */
    byte PIRL3       :1;                                       /* Port L Input Divider Ratio SelectBit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPIRL :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PIRLSTR;
extern volatile PIRLSTR _PIRL @(REG_BASE + 0x0000026CUL);
#define PIRL                            _PIRL.Byte
#define PIRL_PIRL0                      _PIRL.Bits.PIRL0
#define PIRL_PIRL1                      _PIRL.Bits.PIRL1
#define PIRL_PIRL2                      _PIRL.Bits.PIRL2
#define PIRL_PIRL3                      _PIRL.Bits.PIRL3
#define PIRL_PIRL                       _PIRL.MergedBits.grpPIRL

